tutorials/passive_scalar_pitzDaily/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
# Pre-configured pitzDaily case extended with a passive scalar `s`. The
# bundled `my_models/` package contains the reference plugin
# implementation that doc/tutorials/02-write-a-plugin-model walks the
# reader through; we put it on PYTHONPATH so the case is self-contained.
# Registration happens on import, so the solver is started from an
# interpreter that imports `my_models` first rather than via the CLI.
touch passive_scalar_pitzDaily.foam
restore0Dir

runApplication blockMesh

export PYTHONPATH="$PWD:${PYTHONPATH}"
runApplication python -c "import my_models; from neofoam.cli.app import app; app(['solver', 'incompressiblefluid'])"

#------------------------------------------------------------------------------
